source/_static/diagrams/21-writing-one-from-nothing-2.d2
direction: right
n0: "sources + checksums"
n1: "easyblock"
n2: "sanity_check_paths"
n3: "new .eb"
n0 -> n1
n1 -> n2
n2 -> n3
